<a href="https://colab.research.google.com/github/SaiDhanyaa/ExcelR_Assignments/blob/main/ASSIGNMENT_12_RANDOM_FOREST_FRAUD_CHECK.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# Random Forest Classification
import pandas as pd
from sklearn.model_selection import KFold
from sklearn.model_selection import cross_val_score
from sklearn.ensemble import RandomForestClassifier


data = pd.read_csv('/content/Fraud_check.csv')
data.head()

  Undergrad Marital.Status  ...  Work.Experience  Urban
0        NO         Single  ...               10    YES
1       YES       Divorced  ...               18    YES
2        NO        Married  ...               30    YES
3       YES         Single  ...               15    YES
4        NO        Married  ...               28     NO

[5 rows x 6 columns]

In [ ]:
# ## Preprocessing

In [ ]:
data.loc[data["Taxable.Income"] <= 30000,"Taxable_Income"]="Risky"
data.loc[data["Taxable.Income"] > 30001,"Taxable_Income"]="Good"

In [ ]:
# ### Label Encoding

In [ ]:
#Complete company dataset
label_encoder = preprocessing.LabelEncoder()
data['Undergrad']= label_encoder.fit_transform(data['Undergrad']) 
data['Marital.Status']= label_encoder.fit_transform(data['Marital.Status']) 
data['Urban']= label_encoder.fit_transform(data['Urban']) 
data['Taxable_Income']= label_encoder.fit_transform(data['Taxable_Income'])

In [ ]:
data.head()

   Undergrad  Marital.Status  ...  Urban  Taxable_Income
0          0               2  ...      1               0
1          1               0  ...      1               0
2          0               1  ...      1               0
3          1               2  ...      1               0
4          0               1  ...      0               0

[5 rows x 7 columns]

In [ ]:
x=data[['Undergrad','Marital.Status','Taxable.Income','Work.Experience','Urban']]
y=data['Taxable_Income']

seed = 7

num_trees = 100
max_features = 3
kfold = KFold(n_splits=10, random_state=7)
model = RandomForestClassifier(n_estimators=num_trees, max_features=max_features)
results = cross_val_score(model, x, y, cv=kfold)
print(results.mean())

/usr/local/lib/python3.7/dist-packages/sklearn/model_selection/_split.py:296: FutureWarning: Setting a random_state has no effect since shuffle is False. This will raise an error in 0.24. You should leave random_state to its default (None), or set shuffle=True.
  FutureWarning

0.9983333333333334

In [ ]:
results

array([1.        , 1.        , 1.        , 1.        , 0.98333333,
       1.        , 1.        , 1.        , 1.        , 1.        ])